RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_ll_rtc.h
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP1OUT   (0U << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP2OUT   (1U << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP3OUT   (2U << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP4OUT   (3U << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP5OUT   (4U << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP6OUT   (5U << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP7OUT   (6U << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP8OUT   (7U << TAMP_ATCR2_ATOSEL8_Pos)
#endif /* RTC_TAMP_NB */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_BKP  BACKUP
  * @{
  */
#define LL_RTC_BKP_NUMBER                  RTC_BACKUP_NB
#define LL_RTC_BKP_DR0                     0U
#define LL_RTC_BKP_DR1                     1U
#define LL_RTC_BKP_DR2                     2U
#define LL_RTC_BKP_DR3                     3U
#define LL_RTC_BKP_DR4                     4U
#define LL_RTC_BKP_DR5                     5U
#define LL_RTC_BKP_DR6                     6U
#define LL_RTC_BKP_DR7                     7U
#define LL_RTC_BKP_DR8                     8U
#define LL_RTC_BKP_DR9                     9U
#define LL_RTC_BKP_DR10                    10U
#define LL_RTC_BKP_DR11                    11U
#define LL_RTC_BKP_DR12                    12U
#define LL_RTC_BKP_DR13                    13U
#define LL_RTC_BKP_DR14                    14U
#define LL_RTC_BKP_DR15                    15U
#define LL_RTC_BKP_DR16                    16U
#define LL_RTC_BKP_DR17                    17U
#define LL_RTC_BKP_DR18                    18U
#define LL_RTC_BKP_DR19                    19U
#define LL_RTC_BKP_DR20                    20U
#define LL_RTC_BKP_DR21                    21U
#define LL_RTC_BKP_DR22                    22U
#define LL_RTC_BKP_DR23                    23U
#define LL_RTC_BKP_DR24                    24U
#define LL_RTC_BKP_DR25                    25U
#define LL_RTC_BKP_DR26                    26U
#define LL_RTC_BKP_DR27                    27U
#define LL_RTC_BKP_DR28                    28U
#define LL_RTC_BKP_DR29                    29U
#define LL_RTC_BKP_DR30                    30U
#define LL_RTC_BKP_DR31                    31U
/**
  * @}
  */

/** @defgroup RTC_LL_EC_WAKEUPCLOCK_DIV  WAKEUP CLOCK DIV
  * @{
  */
#define LL_RTC_WAKEUPCLOCK_DIV_16          0U                                    /*!< RTC/16 clock is selected */
#define LL_RTC_WAKEUPCLOCK_DIV_8           RTC_CR_WUCKSEL_0                      /*!< RTC/8 clock is selected  */
#define LL_RTC_WAKEUPCLOCK_DIV_4           RTC_CR_WUCKSEL_1                      /*!< RTC/4 clock is selected  */
#define LL_RTC_WAKEUPCLOCK_DIV_2           (RTC_CR_WUCKSEL_1 | RTC_CR_WUCKSEL_0) /*!< RTC/2 clock is selected  */
#define LL_RTC_WAKEUPCLOCK_CKSPRE          RTC_CR_WUCKSEL_2                      /*!< ck_spre (usually 1 Hz) clock is selected                                              */
#define LL_RTC_WAKEUPCLOCK_CKSPRE_WUT      (RTC_CR_WUCKSEL_2 | RTC_CR_WUCKSEL_1) /*!< ck_spre (usually 1 Hz) clock is selected and 2exp16 is added to the WUT counter value */
/**
  * @}
  */

#if defined(RTC_CR_COE)
/** @defgroup RTC_LL_EC_CALIB_OUTPUT  Calibration output
  * @{
  */
#define LL_RTC_CALIB_OUTPUT_NONE           0U                          /*!< Calibration output disabled  */
#define LL_RTC_CALIB_OUTPUT_1HZ            (RTC_CR_COE | RTC_CR_COSEL) /*!< Calibration output is 1 Hz   */
#define LL_RTC_CALIB_OUTPUT_512HZ          RTC_CR_COE                  /*!< Calibration output is 512 Hz */
/**
  * @}
  */
#endif /* RTC_CR_COE */

/** @defgroup RTC_LL_EC_CALIB_INSERTPULSE  Calibration pulse insertion
  * @{
  */
#define LL_RTC_CALIB_INSERTPULSE_NONE      0U                    /*!< No RTCCLK pulses are added                                                                      */
#define LL_RTC_CALIB_INSERTPULSE_SET       RTC_CALR_CALP         /*!< One RTCCLK pulse is effectively inserted every 2exp11 pulses (frequency increased by 488.5 ppm) */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_CALIB_PERIOD  Calibration period
  * @{
  */
#define LL_RTC_CALIB_PERIOD_32SEC          0U                    /*!< Use a 32-second calibration cycle period */
#define LL_RTC_CALIB_PERIOD_16SEC          RTC_CALR_CALW16       /*!< Use a 16-second calibration cycle period */
#define LL_RTC_CALIB_PERIOD_8SEC           RTC_CALR_CALW8        /*!< Use a 8-second calibration cycle period  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_CALIB_LOWPOWER  Calibration low power
  * @{
  */
#define LL_RTC_CALIB_LOWPOWER_NONE         0U                    /*!< High conso mode */
#define LL_RTC_CALIB_LOWPOWER_SET          RTC_CALR_LPCAL        /*!< Low power mode  */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_BINARY_MODE  Binary mode (Sub Second Register)
  * @{
  */
#define LL_RTC_BINARY_NONE                 0U                    /*!< Free running BCD calendar mode (Binary mode disabled) */
#define LL_RTC_BINARY_ONLY                 RTC_ICSR_BIN_0        /*!< Free running Binary mode (BCD mode disabled)          */
#define LL_RTC_BINARY_MIX                  RTC_ICSR_BIN_1        /*!< Free running BCD calendar and Binary mode enable      */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_BINARY_MIX_BCDU  Calendar second incrementation in Binary mix mode
  * @{
  */
#define LL_RTC_BINARY_MIX_BCDU_0           0U                            /*!< 1s calendar increment is generated each time SS[7:0] = 0  */
#define LL_RTC_BINARY_MIX_BCDU_1           (0x1UL << RTC_ICSR_BCDU_Pos)  /*!< 1s calendar increment is generated each time SS[8:0] = 0  */
#define LL_RTC_BINARY_MIX_BCDU_2           (0x2UL << RTC_ICSR_BCDU_Pos)  /*!< 1s calendar increment is generated each time SS[9:0] = 0  */
#define LL_RTC_BINARY_MIX_BCDU_3           (0x3UL << RTC_ICSR_BCDU_Pos)  /*!< 1s calendar increment is generated each time SS[10:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_4           (0x4UL << RTC_ICSR_BCDU_Pos)  /*!< 1s calendar increment is generated each time SS[11:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_5           (0x5UL << RTC_ICSR_BCDU_Pos)  /*!< 1s calendar increment is generated each time SS[12:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_6           (0x6UL << RTC_ICSR_BCDU_Pos)  /*!< 1s calendar increment is generated each time SS[13:0] = 0 */
#define LL_RTC_BINARY_MIX_BCDU_7           (0x7UL << RTC_ICSR_BCDU_Pos)  /*!< 1s calendar increment is generated each time SS[14:0] = 0 */
/**
  * @}
  */

#if defined(RTC_SECCFGR_SEC)
/** @defgroup RTC_LL_EC_SECURE_RTC_FULL  Secure full rtc
  * @{
  */
#define LL_RTC_SECURE_FULL_YES             RTC_SECCFGR_SEC       /*!< RTC full secure                                                                  */
#define LL_RTC_SECURE_FULL_NO              0U                    /*!< RTC is not full secure, features can be secure. See RTC_LL_EC_SECURE_RTC_FEATURE */
/**
  * @}
  */
#endif /* RTC_SECCFGR_SEC */

/** @defgroup RTC_LL_EC_SECURE_RTC_FEATURE  Secure features rtc in case of LL_RTC_SECURE_FULL_NO.
  * @{
  */
#define LL_RTC_SECURE_FEATURE_INIT         RTC_SECCFGR_INITSEC   /*!< Initialization feature is secure */
#define LL_RTC_SECURE_FEATURE_CAL          RTC_SECCFGR_CALSEC    /*!< Calibration feature is secure    */
#define LL_RTC_SECURE_FEATURE_TS           RTC_SECCFGR_TSSEC     /*!< Time stamp feature is secure     */
#define LL_RTC_SECURE_FEATURE_WUT          RTC_SECCFGR_WUTSEC    /*!< Wake up timer feature is secure  */
#define LL_RTC_SECURE_FEATURE_ALRA         RTC_SECCFGR_ALRASEC   /*!< Alarm A feature is secure        */
#define LL_RTC_SECURE_FEATURE_ALRB         RTC_SECCFGR_ALRBSEC   /*!< Alarm B feature is secure        */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_SECURE_TAMP  Secure tamp
  * @{
  */
#define LL_TAMP_SECURE_FULL_YES            TAMP_SECCFGR_TAMPSEC  /*!< TAMP full secure   */
#define LL_TAMP_SECURE_FULL_NO             0U                    /*!< TAMP is not secure */
/**
  * @}
  */

#if defined(RTC_PRIVCFGR_PRIV)
/** @defgroup RTC_LL_EC_PRIVILEGE_RTC_FULL  Privilege full rtc
  * @{
  */
#define LL_RTC_PRIVILEGE_FULL_YES          RTC_PRIVCFGR_PRIV     /*!< RTC full privilege                                                                          */
#define LL_RTC_PRIVILEGE_FULL_NO           0U                    /*!< RTC is not full privilege, features can be unprivilege. See RTC_LL_EC_PRIVILEGE_RTC_FEATURE */
/**
  * @}
  */
#endif /* RTC_PRIVCFGR_PRIV */

